app/controllers/school_classes_controller.rb

    def update
        @school_class=SchoolClass.find(params[:id])
        @school_class.update(actual_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "penguins"], ["room_number", 9], ["updated_at", "2020-05-17 22:56:28.833987"], ["id", 1]]