app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "sofia"], ["last_name", "tofigh"], ["created_at", "2020-05-17 22:35:18.341007"], ["updated_at", "2020-05-17 22:35:18.341007"]]
---
    def create
        @student=Student.create(actual_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
UPDATE "students" SET "last_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["last_name", "tofigh"], ["updated_at", "2020-05-17 22:40:36.270106"], ["id", 15]]
---
    def update
        @student=Student.find(params[:id])
        @student.update(actual_params)